#include <iostream>

int main() {
    int tableware[12][2] = {{4,4},
                            {3,3},
                            {3,3},
                            {3,3},
                            {3,3},
                            {3,3},
                            {3,3},
                            {3,3},
                            {3,3},
                            {3,3},
                            {3,3},
                            {3,3}}; //массив столовых приборов
    int plates[12][2] = {{3,3},
                         {2,2},
                         {2,2},
                         {2,2},
                         {2,2},
                         {2,2},
                         {2,2},
                         {2,2},
                         {2,2},
                         {2,2},
                         {2,2},
                         {2,2}}; //массив тарелок
    int chairs[12][2] = {{1,1},
                         {1,1},
                         {1,1},
                         {1,1},
                         {1,1},
                         {1,1},
                         {1,1},
                         {1,1},
                         {1,1},
                         {1,1},
                         {1,1},
                         {1,1}}; //массив стульев
    chairs[4][0]+=1; //приставили стул для женщны с ребенком
    tableware[2][1]-=1; //пропала ложка
    tableware[0][0]-=1; //вип поделился ложкой
    tableware[2][1]+=1; //вип поделился ложкой
    plates[0][0]-=1; //абрали тарелку у випа

    //проверки
    for (int i=0;i<12;++i) {
        for (int j=0; j<2;++j) {
            std::cout<<tableware[i][j]<<" ";
        }
        std::cout<<std::endl;
    }
    std::cout<<std::endl;
    for (int i=0;i<12;++i) {
        for (int j=0; j<2;++j) {
            std::cout<<plates[i][j]<<" ";
        }
        std::cout<<std::endl;
    }
    std::cout<<std::endl;
    for (int i=0;i<12;++i) {
        for (int j=0; j<2;++j) {
            std::cout<<chairs[i][j]<<" ";
        }
        std::cout<<std::endl;
    }
}
